{
  "configVersion": "1.0.0",
  "lastUpdated": "2025-07-20T18:31:35.445Z",
  "playlists": {
    "rightHanded": {
      "tutorialPlaylistId": "PLN2pz6FdG2SEopNcus2l8yMfA53UMB0aH",
      "faqPlaylistId": "PLN2pz6FdG2SFmcipKxfs6E4HMwKomLvsX",
      "steps": [
        {
          "id": "step1",
          "title": "Step 1: Casting On",
          "description": "The first step to knitting the Dream Cowl is getting the stitches on your needles - we'll start with a slip knot and use the Long Tail Cast On Method to put 90 stitches on the needles (slip knot included.)\n\nStart by preparing your materials, including circular needles and center-pull yarn. \n1. Make a Slip Knot: draw out several yards/meters of yarn and create a slip knot in between the long tail and the yarn ball. Place the slip knot on the needle and gently cinch it down. This is your first cast on stitch.\n2. Cast On: Place the yarn tail over your thumb and the working yarn over your index finger. Secure both strands in your palm. Move the needle under the thumb yarn, over the finger yarn, and pull the yarn through the loop on your thumb, cinching gently on the needle–1 more stitch cast on. \n3. Continue: Repeat this method until all 90 stitches have been cast on.\n\nThe Long Tail Cast On can be really tricky, so be patient and take it slow. If you need to release the yarns, that's ok - when you pick them back up just place the tail over your thumb and the yarn ball strand over your index finger to continue.\n\nKeywords: knitting tutorial, longtail cast on, right-handed knitting, beginner knitting techniques, yarn preparation, slip knot, casting on stitches, how to knit for absolute beginners",
          "videoId": "UEr_o4QpBnM"
        },
        {
          "id": "step2",
          "title": "Step 2: the Knit Stitch",
          "description": "Now we're ready to knit: we'll start by untwisting our work, then we'll join in the round and knit until our cowl is 9\"/22.5 cm. At the end of the video, we'll show you how to join a new ball of yarn, which you'll do when come to the end of your first ball of yarn.\n\nPlace the end with the working yarn attached next to your right hand. This is working needle. \n1. Ensure No Twists: Lay your needles flat on the table, and remove any twists, making sure all the stitches point in the same direction. \n2. Place Marker: Place a stitch marker on your working needle (right needle.) \n3. Knit: Holding the working needle in your right hand, insert the needle tip into the front of the first stitch on your holding needle (left needle) from left to right. Wrap the yarn around the needle, and draw the loop through the stitch, removing the worked stitch from the holding needle.   \n4. Repeat: knit all 90 stitches on the needle until you make your way back to the stitch marker.\n5. Slip the marker (just transfer it from your holding needle to your working needle) and continue to knit about 42 more rounds, or until your cowl measures around 9\"/22.5 cm.\n\nWhen you come to the end of your first ball of yarn, overlap the tail of the new ball so the ends point in opposite directions. Hold both strands of yarn together and knit with them for 3 stitches. Then drop the old yarn tail, and continue knitting with the new yarn. When you come back around to these stitches, be sure to knit both yarn loops as if they're one stitch. Gently pull the tails to tighten up the stitches as needed.",
          "videoId": "rzgZ6Y-40DE"
        },
        {
          "id": "step3",
          "title": "Step 3: Decreasing",
          "description": "To make the Dream Cowl slightly narrower at the top, we'll learn to decrease with the Knit 2 Together or k2tog stitch. \n\nAt this point, you should have about 43 rounds, and the cowl should be about 9\"/22.5 cm tall. If it's a little shorter or a little longer, that's ok! We're going to make decreases evenly all the way around by knitting the 9th and 10th stitches together.\n1. Set Up: Knit 8 stitches normally.\n2. Decrease: Now Insert the needle into both the 9th and 10th stitches, and knit them together as if one stitch. \n3. Repeat: Continue this process around the piece, knit 8, then knit 2 together, or in knitting shorthand [k8, k2tog] repeat to end. If your stitch count is off, don't worry! If you don't have enough stitches at the end, skip the last decrease; if there are too many, just k2tog at the end. \n\nNow knit 4 more rounds.",
          "videoId": "7uAIiwJjM78"
        },
        {
          "id": "step4",
          "title": "Step 4: the Purl Stitch",
          "description": "There are 2 foundational stitches in knitting - we've learned the knit stitch and now we need to learn the purl stitch! \n\nHere's how:\n1. Position the Yarn: Bring the yarn to the front between the needles without going over the needle.\n2. Purl: Insert the needle into the front of the stitch from right  to left (purlwise), wrap the yarn around the needle and pull the stitch through to the back. \n3. Repeat: Continue to the end of the round. \n\nNow work 4 more rounds, alternating between knit and purl rounds: Knit 1 round, Purl 1 round, Knit 1 round, Purl 1 round. This is called Garter Stitch.",
          "videoId": "XrPOW280EmA"
        },
        {
          "id": "step5",
          "title": "Step 5: Binding Off",
          "description": "Now we need to work our stitches off the needles, securing them so they can't come undone. \n \nAfter working 4 rounds of garter stitch (alternating knit rounds and purl rounds and ending with a purl round), return your yarn to the back for the bind off and remove the stitch marker.  \n1. Set Up: Binding off involves 2 stitches, so you'll always need to have to 2 stitches on your working needle to bind off. Knit 2 stitches, keeping the stitches loose.\n2. Bind Off: Using your holding needle (left needle), lift up the first stitch you knit and pass it over the second stitch and off the working needle. One stitch bound off! \n3. Repeat: K1 so you have 2 stitches on your working needle, then bind off by passing the first stitch over the second one. Keep your stitches loose, repeat these steps until you reach the last stitch.\n4. Last Stitch: Cut your yarn, remove the working needle, and draw the yarn tail through the last stitch to secure the bind off.\n\nWoohoo! That's it! Now just a few finishing steps to make your knitting even better.",
          "videoId": "PRD_qMPGFYo"
        },
        {
          "id": "step6",
          "title": "Step 6: Finishing Up",
          "description": "Now we just need to weave in the ends and give our knitting a good bath (called blocking) to relax the fabric. \n\n1. Weave In Ends: Thread a tapestry needle and weave in all the loose ends by drawing the needle through a few stitches on the inside, changing direction a few times. Cut the tail short.\n2. Block: Submerge your work in cool water (no soap needed), and lay flat to dry.\n3. Wear & Share: Wear your cowl out on the town and tell everyone you made it! You should be really proud.",
          "videoId": "RVMz83UeKYY"
        }
      ],
      "faqVideos": [
        {
          "id": "faq1",
          "title": "Fundamentals of Knitting: How to Do the Knit Stitch for Right Handed Beginners",
          "description": "Learn the fundamentals of knitting: the knit stitch. It's the only stitch you need to call yourself a knitter!\n\nLike every skill, knitting takes time to learn. Be patient with yourself and remember that all new things take practice! If it doesn't work the first time, keep trying. You'll get it.\n\nTo work a knit stitch, poke your working needle (the right needle for right handed knitters) into the stitch knitwise (from left to right, front to back for righties), wrap the yarn around from bottom to top and draw the loop through. Then slide the stitch that you worked off the holding needle (the left needle for righties). And now you're a knitter! \n\n#knitting #knittingforbeginners #knittingtutorial #knittingstitch #knitstitch #knitrino #stitchybee",
          "videoId": "WdjSZ-2T4n0"
        },
        {
          "id": "faq2",
          "title": "Learn to Knit the Purl Stitch - Knitting for Right Handed Beginners",
          "description": "This knitting tutorial shows how to create a purl stitch in slow motion! If you're looking for a step-by-step tutorial for absolute beginners, you've come to the right place. Both continental and english style techniques are shown in this video. \n\nThe purl stitch is one of the foundational knitting stitches, and you might be surprised to learn that the back of a knit stitch is a purl, and the back of a purl stitch is a knit stitch! They go hand and hand and can be used together to create all kinds of different textures and techniques, like garter stitch, ribbing, moss stitch, and so much more! \n\nTo create a purl stitch, bring the yarn between the needles to the front. Insert the working needle into the stitch, staying on the front side of the fabric. Wrap the yarn around the needle from top to bottom, then pull the loop through to the back. As you release the stitch from the holding needle, you'll see the characteristic purl bump. Repeat this process—bring yarn to the front, insert needle, wrap yarn, pull through, and release—to create a row of purl stitches.",
          "videoId": "g19lQm9RNPw"
        },
        {
          "id": "faq3",
          "title": "How to Tie a Slip Knot for Total Beginners - Essential Slipknot Knitting Tutorial",
          "description": "Learn how to make or tie a slip knot, the first and essential step to knitting! In this tutorial, we'll guide you through tying a slip knot with ease, an important technique for any beginner knitter. To create a slip knot, loop the yarn around your fingers, turn the loop to make a cross, fold down, pick up the leg, pull it through the loop, and gently cinch it down. Remember, it shouldn't be too tight, allowing the loop to be free to move on your needle.\n\nWhether you're just starting or need a quick refresher, this video provides a clear and concise demonstration. Mastering the slip knot will make your knitting projects more manageable and enjoyable.\n\nKeywords: slip knot, slipknot knitting, knitting, beginner knitting, how to knit, knitting tutorial, knitting for beginners, learn to knit, slip knot knitting, right handed knitting, knitting techniques, stitch dictionary, easy knitting, step by step knitting, knitting stitches, modern knitting, knitting patterns\n\n#HowtoMakeaSlipKnot #SlipKnot #KnittingTutorial #LearnToKnit #KnittingForBeginners #SlipKnotKnitting #RightHandedKnitting #EasyKnitting #KnittingStitches #ModernKnitting #BeginnerKnitting #KnittingPatterns #KnittingTechniques #YarnLovers #Crafting",
          "videoId": "Hy1QQ7Xh1Yc"
        }
      ]
    },
    "leftHanded": {
      "tutorialPlaylistId": "PLN2pz6FdG2SEg5EflrkzoelsC-AVQS7YP",
      "faqPlaylistId": "PLN2pz6FdG2SGf9DENOLeyKCfjGO17EjKG",
      "steps": [
        {
          "id": "step1",
          "title": "Step 1: Casting On",
          "description": "For left handed knitters, the first step to knitting the Dream Cowl is getting the stitches on your needles - we'll start with a slip knot and use the Long Tail Cast On Method to put 90 stitches on the needles (slip knot included.)\n\nStart by preparing your materials, including circular needles and center-pull yarn. \n1. Make a Slip Knot: draw out several yards/meters of yarn and create a slip knot in between the long tail and the yarn ball. Place the slip knot on the needle and gently cinch it down. This is your first cast on stitch.\n2. Cast On: Place the yarn tail over your thumb and the working yarn over your index finger. Secure both strands in your palm. Move the needle under the thumb yarn, over the finger yarn, and pull the yarn through the loop on your thumb, cinching gently on the needle–1 more stitch cast on. \n3. Continue: Repeat this method until all 90 stitches have been cast on.\n\nThe Long Tail Cast On can be really tricky, so be patient and take it slow. If you need to release the yarns, that's ok - when you pick them back up just place the tail over your thumb and the yarn ball strand over your index finger to continue.\n\nKeywords: knitting tutorial, longtail cast on, right-handed knitting, beginner knitting techniques, yarn preparation, slip knot, casting on stitches, how to knit for absolute beginners",
          "videoId": "2tpCrNBQ2Io"
        },
        {
          "id": "step2",
          "title": "Step 2: the Knit Stitch",
          "description": "Now we're ready to knit: we'll start by untwisting our work, then we'll join in the round and knit until our cowl is 9\"/22.5 cm. At the end of the video, we'll show you how to join a new ball of yarn, which you'll do when come to the end of your first ball of yarn (before your cowl is 9\").\n\nPlace the end with the working yarn attached next to your left hand. This is working needle. \n1. Ensure No Twists: Lay your needles flat on the table, and remove any twists, making sure all the stitches point in the same direction. \n2. Place Marker: Place a stitch marker on your working needle (left needle.) \n3. Knit: Holding the working needle in your left hand, insert the needle tip into the front of the first stitch on your holding needle (right needle) from right to left. Wrap the yarn around the needle, and draw the loop through the stitch, removing the worked stitch from the holding needle.   \n4. Repeat: knit all 90 stitches on the needle until you make your way back to the stitch marker.\n5. Slip the marker (just transfer it from your holding needle to your working needle) and continue to knit about 42 more rounds, or until your cowl measures around 9\"/22.5 cm.\n\nWhen you come to the end of your first ball of yarn, overlap the tail of the new ball so the ends point in opposite directions. Hold both strands of yarn together and knit with them for 3 stitches. Then drop the old yarn tail, and continue knitting with the new yarn. When you come back around to these stitches, be sure to knit both yarn loops as if they're one stitch. Gently pull the tails to tighten up the stitches as needed.",
          "videoId": "qR7FEpDHrM4"
        },
        {
          "id": "step3",
          "title": "Step 3: Decreasing",
          "description": "To make the Dream Cowl slightly narrower at the top, we'll need to use the Knit 2 Together or k2tog to decrease. Then we'll knit 4 more rounds as usual.\n\nAt this point, you should have about 43 rounds, and the cowl should be about 9\"/22.5 cm tall. If it's a little shorter or a little longer, that's ok! We're going to make decreases evenly all the way around by knitting every 9th and 10th stitches together.\n1. Set Up: Knit 8 stitches normally.\n2. Decrease: Now Insert the needle into both the 9th and 10th stitches, and knit them together as if one stitch. \n3. Repeat: Continue this process around the piece, knit 8, then knit 2 together, or in knitting shorthand [k8, k2tog] repeat to end. If your stitch count is off, don't worry! If you don't have enough stitches at the end, skip the last decrease; if there are too many, just put your last k2tog at the end. \n\nNow knit 4 more rounds.",
          "videoId": "xCsa1SUAp4w"
        },
        {
          "id": "step4",
          "title": "Step 4: the Purl Stitch",
          "description": "There are 2 foundational stitches in knitting - we've learned the knit stitch and now we'll learn the purl stitch! We'll work one purl round, then a knit round,  purl round, knit round, purl round, for a total of 5 rounds. \n\nHere's how:\n1. Position the Yarn: Bring the yarn to the front between the needles without going over the needle.\n2. Purl: Insert the working needle into the front of the stitch from left to right (purlwise), wrap the yarn around the needle and pull the stitch through to the back. \n3. Repeat: Continue to the end of the round. \n\nNow work 4 more rounds, alternating between knit and purl rounds: Knit 1 round, Purl 1 round, Knit 1 round, Purl 1 round. This is called Garter Stitch.",
          "videoId": "QB4KEEbs_OY"
        },
        {
          "id": "step5",
          "title": "Step 5: Binding Off",
          "description": "Now we need to work our stitches off the needles, securing them so they can't come undone. This is called binding off or casting off.\n \nAfter working 4 rounds of garter stitch (alternating knit rounds and purl rounds and ending with a purl round), return your yarn to the back for the bind off and remove the stitch marker.  \n1. Set Up: Binding off involves 2 stitches, so you'll always need to have to 2 stitches on your working needle to bind off. Knit 2 stitches, keeping the stitches loose.\n2. Bind Off: Using your holding needle (right needle), lift up the first stitch you knit and pass it over the second stitch and off the working needle. One stitch bound off! \n3. Repeat: K1 so you have 2 stitches on your working needle, then bind off by passing the first stitch over the second one. Keep your stitches loose, repeat these steps until you reach the last stitch.\n4. Last Stitch: Cut your yarn, remove the working needle, and draw the yarn tail through the last stitch to secure the bind off.\n\nWoohoo! That's it! Now just a few finishing steps to make your knitting even better.",
          "videoId": "1YLbUiODXy4"
        },
        {
          "id": "step6",
          "title": "Step 6: Finishing Up",
          "description": "Now we just need to weave in the ends and give our knitting a good bath (called blocking) to relax the fabric. \n\n1. Weave In Ends: Thread a tapestry needle and weave in all the loose ends by drawing the needle through a few stitches on the inside, changing direction a few times. Cut the tail short.\n2. Block: Submerge your work in cool water (no soap needed), and lay flat to dry.\n3. Wear & Share: Wear your cowl out on the town and tell everyone you made it! You should be really proud.",
          "videoId": "HAi-hPoYQrs"
        }
      ],
      "faqVideos": [
        {
          "id": "faq1",
          "title": "Fundamentals of Knitting: How to Do the Knit Stitch for Left Handed Beginners",
          "description": "Learn the fundamentals of knitting: the knit stitch. It's the only stitch you need to call yourself a knitter!\n\nLike every skill, knitting takes time to learn. Be patient with yourself and remember that all new things take practice! If it doesn't work the first time, keep trying. You'll get it.\n\nTo work a knit stitch, poke your working needle (the left needle for left handed knitters) into the stitch knitwise (from right to left, front to back for lefties), wrap the yarn around from bottom to top and draw the loop through. Then slide the stitch that you worked off the holding needle (the right needle for lefties). And now you're a knitter! \n\n#knitting #knittingforbeginners #knittingtutorial #knittingstitch #knitstitch #knitrino #stitchybee #mirrorknitting #lefthandedknitting",
          "videoId": "eV6StYsTNNU"
        },
        {
          "id": "faq2",
          "title": "Learn to Knit the Purl Stitch - Knitting for Left Handed Beginners",
          "description": "This knitting tutorial shows how to create a purl stitch in slow motion for lefties (mirror knitting)! If you're looking for a step-by-step tutorial for absolute beginners, you've come to the right place. Both continental and english style techniques are shown in this video. \n\nThe purl stitch is one of the foundational knitting stitches, and you might be surprised to learn that the back of a knit stitch is a purl, and the back of a purl stitch is a knit stitch! They go hand and hand and can be used together to create all kinds of different textures and techniques, like garter stitch, ribbing, moss stitch, and so much more! \n\nTo create a purl stitch, bring the yarn between the needles to the front. Insert the working needle into the stitch, staying on the front side of the fabric. Wrap the yarn around the needle from top to bottom, then pull the loop through to the back. As you release the stitch from the holding needle, you'll see the characteristic purl bump. Repeat this process—bring yarn to the front, insert needle, wrap yarn, pull through, and release—to create a row of purl stitches.",
          "videoId": "m7xz3rxrUX8"
        }
      ]
    }
  }
}